<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"9e411b33a8bf83a0a424794eb8b6789e86942334f45b324a046732db1dbf32f2","plan_job_ref":"Job Create PR TF Plan comment #2 at https://github.com/RuneORakeie/sqlkonferenz2025/actions/runs/13589459852","plan_out_hash":"08ae71e8f62613ea7a1316df0bc29013b642afc404433d3be7e423a516223973","plan_hash":"f6eac02ea862e8cd753036a56fc553f1c299f01331f42e76c28cb7dd03b26562","plan_text_format":"diff","version":"1.46.1","closed":true} -->
Terraform plan in __./tf__
With backend config: `resource_group_name=ClauseFabric storage_account_name=tfsamsfabrictfstate container_name=tfstate key=terraform-msfabric-restore.tfstate`<details open><summary>With variables</summary>

```hcl
admin_user        = (sensitive value)
admin_user2       = (sensitive value)
azeventhub_saskey = (sensitive value)
client_id         = (sensitive value)
client_secret     = (sensitive value)
tenant_id         = (sensitive value)
```
</details>
<details>
<summary>Plan: 8 to add, 6 to change, 8 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # azuread_group.fabric_ws_contributors will be updated in-place
!~  resource "azuread_group" "fabric_ws_contributors" {
        id                             = "/groups/c1d79f51-4298-4487-b11e-9df13fd2fc3b"
!~      owners                         = [
+           "aa5edc36-080b-4b9c-bcee-3b95cabd902d",
#            (1 unchanged element hidden)
        ]
#        (29 unchanged attributes hidden)
    }

  # fabric_eventhouse.kql_demo will be created
+   resource "fabric_eventhouse" "kql_demo" {
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "eh-sqlkonferenz2025"
+       id                        = (known after apply)
+       properties                = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_eventhouse.kql_demo_restore will be destroyed
  # (because fabric_eventhouse.kql_demo_restore is not in configuration)
-   resource "fabric_eventhouse" "kql_demo_restore" {
-       definition_update_enabled = true -> null
-       description               = "" -> null
-       display_name              = "eh-datamonster" -> null
-       id                        = "bda3ca35-a27b-42ef-a8aa-fa61ac078ebc" -> null
-       properties                = {
-           database_ids          = [
-               "c5eb6783-9405-4955-a8d5-aefa6a0ec5b1",
            ] -> null
-           ingestion_service_uri = "https://ingest-trd-efqzsjk72dgs5n03tk.z7.kusto.fabric.microsoft.com" -> null
-           query_service_uri     = "https://trd-efqzsjk72dgs5n03tk.z7.kusto.fabric.microsoft.com" -> null
        } -> null
-       workspace_id              = "fd050b31-af6f-49ba-b8a1-5d974ee22420" -> null
    }

  # fabric_eventstream.kql_demo_es will be created
+   resource "fabric_eventstream" "kql_demo_es" {
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-es-sqlkonferenz2025"
+       id                        = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_kql_dashboard.kql_demo_dash will be created
+   resource "fabric_kql_dashboard" "kql_demo_dash" {
+       definition_update_enabled = true
+       description               = "kql-dash-sqlkonferenz2025"
+       display_name              = "kql-dash-sqlkonferenz2025"
+       id                        = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_kql_dashboard.kql_demo_dash_restore will be destroyed
  # (because fabric_kql_dashboard.kql_demo_dash_restore is not in configuration)
-   resource "fabric_kql_dashboard" "kql_demo_dash_restore" {
-       definition                = {
-           "RealTimeDashboard.json" = {
-               source                = "../item-templates/RealTimeDashboard.json" -> null
-               source_content_sha256 = "716351a75f210863746c1277523e31e569866e88a1ac2084abe172afd2af3f30" -> null
-               tokens                = {
-                   "KqlDbId"     = "e89796d0-7de2-42f3-94f7-c081db6e4000"
-                   "QuerySvcUri" = "https://trd-efqzsjk72dgs5n03tk.z7.kusto.fabric.microsoft.com"
-                   "WsId"        = "fd050b31-af6f-49ba-b8a1-5d974ee22420"
                } -> null
            },
        } -> null
-       definition_update_enabled = true -> null
-       description               = "" -> null
-       display_name              = "kql-dash-datamonster" -> null
-       format                    = "Default" -> null
-       id                        = "a002a6ee-7655-444e-b872-d3bf6bdcae63" -> null
-       workspace_id              = "fd050b31-af6f-49ba-b8a1-5d974ee22420" -> null
    }

  # fabric_kql_database.kql_demo_db_1 will be created
+   resource "fabric_kql_database" "kql_demo_db_1" {
+       configuration             = {
+           database_type = "ReadWrite"
+           eventhouse_id = (known after apply)
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-db-sqlkonferenz2025-01"
+       id                        = (known after apply)
+       properties                = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_kql_database.kql_demo_db_1_restore will be destroyed
  # (because fabric_kql_database.kql_demo_db_1_restore is not in configuration)
-   resource "fabric_kql_database" "kql_demo_db_1_restore" {
-       definition                = {
-           "DatabaseProperties.json" = {
-               source                = "../item-templates/DatabaseProperties_01.json.tmpl" -> null
-               source_content_sha256 = "1fcda0fc77860e552c4791878521d0c841328c6955d5468fe79c34a01ed68eb0" -> null
-               tokens                = {
-                   "KqlEhId" = "bda3ca35-a27b-42ef-a8aa-fa61ac078ebc"
                } -> null
            },
-           "DatabaseSchema.kql" = {
-               source                = "../item-templates/DatabaseSchema_01.kql" -> null
-               source_content_sha256 = "4507ca977dab0e1aa16f205c0d92dafebc96e03e50a0d582a6b3f0120cbc300c" -> null
            },
        } -> null
-       definition_update_enabled = true -> null
-       description               = "" -> null
-       display_name              = "kql-db-01-datamonster" -> null
-       format                    = "Default" -> null
-       id                        = "e89796d0-7de2-42f3-94f7-c081db6e4000" -> null
-       properties                = {
-           database_type         = "ReadWrite" -> null
-           eventhouse_id         = "bda3ca35-a27b-42ef-a8aa-fa61ac078ebc" -> null
-           ingestion_service_uri = "https://ingest-trd-efqzsjk72dgs5n03tk.z7.kusto.fabric.microsoft.com" -> null
-           query_service_uri     = "https://trd-efqzsjk72dgs5n03tk.z7.kusto.fabric.microsoft.com" -> null
        } -> null
-       workspace_id              = "fd050b31-af6f-49ba-b8a1-5d974ee22420" -> null
    }

  # fabric_kql_database.kql_demo_db_2 will be created
+   resource "fabric_kql_database" "kql_demo_db_2" {
+       configuration             = {
+           database_type = "ReadWrite"
+           eventhouse_id = (known after apply)
        }
+       definition_update_enabled = true
+       description               = ""
+       display_name              = "kql-db-sqlkonferenz2025-02"
+       id                        = (known after apply)
+       properties                = (known after apply)
+       workspace_id              = "************************************"
    }

  # fabric_kql_database.kql_demo_db_2_restore will be destroyed
  # (because fabric_kql_database.kql_demo_db_2_restore is not in configuration)
-   resource "fabric_kql_database" "kql_demo_db_2_restore" {
-       definition                = {
-           "DatabaseProperties.json" = {
-               source                = "../item-templates/DatabaseProperties_01.json.tmpl" -> null
-               source_content_sha256 = "1fcda0fc77860e552c4791878521d0c841328c6955d5468fe79c34a01ed68eb0" -> null
-               tokens                = {
-                   "KqlEhId" = "bda3ca35-a27b-42ef-a8aa-fa61ac078ebc"
                } -> null
            },
-           "DatabaseSchema.kql" = {
-               source                = "../item-templates/DatabaseSchema_02.kql" -> null
-               source_content_sha256 = "6ceb64df2ef8eb9662dbf7723d3148aac56cc11a273e8b047dfa4fbc217f6710" -> null
            },
        } -> null
-       definition_update_enabled = true -> null
-       description               = "" -> null
-       display_name              = "kql-db-02-datamonster" -> null
-       format                    = "Default" -> null
-       id                        = "db3cc804-1c60-4f9b-a255-1e0958a00ebd" -> null
-       properties                = {
-           database_type         = "ReadWrite" -> null
-           eventhouse_id         = "bda3ca35-a27b-42ef-a8aa-fa61ac078ebc" -> null
-           ingestion_service_uri = "https://ingest-trd-efqzsjk72dgs5n03tk.z7.kusto.fabric.microsoft.com" -> null
-           query_service_uri     = "https://trd-efqzsjk72dgs5n03tk.z7.kusto.fabric.microsoft.com" -> null
        } -> null
-       workspace_id              = "fd050b31-af6f-49ba-b8a1-5d974ee22420" -> null
    }

  # module.demo_ws_prod.fabric_workspace.fab_ws will be updated in-place
!~  resource "fabric_workspace" "fab_ws" {
!~      capacity_region              = "West Europe" -> (known after apply)
        id                           = "e1eacab3-00ad-4acc-bc36-4fd1cf9762ba"
+       identity                     = {
+           application_id       = (known after apply)
+           service_principal_id = (known after apply)
+           type                 = "SystemAssigned"
        }
!~      onelake_endpoints            = {
!~          blob_endpoint = "https://westeurope-onelake.blob.fabric.microsoft.com" -> (known after apply)
!~          dfs_endpoint  = "https://westeurope-onelake.dfs.fabric.microsoft.com" -> (known after apply)
        } -> (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.demo_ws_prod.fabric_workspace_role_assignment.fab_ws_role_assign["0"] will be created
+   resource "fabric_workspace_role_assignment" "fab_ws_role_assign" {
+       id             = (known after apply)
+       principal_id   = "************************************"
+       principal_type = "Group"
+       role           = "Contributor"
+       workspace_id   = "************************************"
    }

  # module.demo_ws_prod.fabric_workspace_role_assignment.fab_ws_role_assign["1"] will be created
+   resource "fabric_workspace_role_assignment" "fab_ws_role_assign" {
+       id             = (known after apply)
+       principal_id   = "************************************"
+       principal_type = "User"
+       role           = "Admin"
+       workspace_id   = "************************************"
    }

  # module.demo_ws_prod.fabric_workspace_role_assignment.fab_ws_role_assign["2"] will be created
+   resource "fabric_workspace_role_assignment" "fab_ws_role_assign" {
+       id             = (known after apply)
+       principal_id   = "************************************"
+       principal_type = "User"
+       role           = "Admin"
+       workspace_id   = "************************************"
    }

  # module.demo_ws_prod_restore.fabric_workspace.fab_ws will be destroyed
  # (because fabric_workspace.fab_ws is not in configuration)
-   resource "fabric_workspace" "fab_ws" {
-       capacity_assignment_progress = "Completed" -> null
-       capacity_id                  = "07ee95e3-ff33-4784-9a17-79beffd3ab18" -> null
-       capacity_region              = "West Europe" -> null
-       description                  = "SQLK2025 - RTI demo workspace" -> null
-       display_name                 = "datamonster - WS" -> null
-       id                           = "fd050b31-af6f-49ba-b8a1-5d974ee22420" -> null
-       identity                     = {
-           application_id       = "e2cbb10d-ef8b-4d12-8a80-dcb70426be73" -> null
-           service_principal_id = "70a3c2e1-aa0f-4327-87af-27c360263bad" -> null
-           type                 = "SystemAssigned" -> null
        } -> null
-       onelake_endpoints            = {
-           blob_endpoint = "https://westeurope-onelake.blob.fabric.microsoft.com" -> null
-           dfs_endpoint  = "https://westeurope-onelake.dfs.fabric.microsoft.com" -> null
        } -> null
-       type                         = "Workspace" -> null
    }

  # module.demo_ws_prod_restore.fabric_workspace_role_assignment.fab_ws_role_assign["0"] will be destroyed
  # (because fabric_workspace_role_assignment.fab_ws_role_assign is not in configuration)
-   resource "fabric_workspace_role_assignment" "fab_ws_role_assign" {
-       id             = "c1d79f51-4298-4487-b11e-9df13fd2fc3b" -> null
-       principal_id   = "c1d79f51-4298-4487-b11e-9df13fd2fc3b" -> null
-       principal_type = "Group" -> null
-       role           = "Contributor" -> null
-       workspace_id   = "fd050b31-af6f-49ba-b8a1-5d974ee22420" -> null
    }

  # module.demo_ws_prod_restore.fabric_workspace_role_assignment.fab_ws_role_assign["1"] will be destroyed
  # (because fabric_workspace_role_assignment.fab_ws_role_assign is not in configuration)
-   resource "fabric_workspace_role_assignment" "fab_ws_role_assign" {
-       id             = "5b2864ad-58d8-4442-a3e9-1c3d1a5cdca6" -> null
-       principal_id   = "5b2864ad-58d8-4442-a3e9-1c3d1a5cdca6" -> null
-       principal_type = "User" -> null
-       role           = "Admin" -> null
-       workspace_id   = "fd050b31-af6f-49ba-b8a1-5d974ee22420" -> null
    }

  # module.demo_ws_prod_restore.fabric_workspace_role_assignment.fab_ws_role_assign["2"] will be destroyed
  # (because fabric_workspace_role_assignment.fab_ws_role_assign is not in configuration)
-   resource "fabric_workspace_role_assignment" "fab_ws_role_assign" {
-       id             = "65dc42b4-71be-4e0a-b1c2-11f961077e1d" -> null
-       principal_id   = "65dc42b4-71be-4e0a-b1c2-11f961077e1d" -> null
-       principal_type = "User" -> null
-       role           = "Admin" -> null
-       workspace_id   = "fd050b31-af6f-49ba-b8a1-5d974ee22420" -> null
    }

  # module.ws_conn_eventhub.restapi_object.connection_role_assignment["0"] will be updated in-place
!~  resource "restapi_object" "connection_role_assignment" {
!~      data         = jsonencode(
!~          {
-               id        = "65dc42b4-71be-4e0a-b1c2-11f961077e1d"
+               principal = {
+                   id   = "65dc42b4-71be-4e0a-b1c2-11f961077e1d"
+                   type = "User"
                }
+               role      = "Owner"
            }
        )
-       debug        = true -> null
+       destroy_path = "/connections/f29bed7c-a452-4329-b967-2c5a333a5bc9/roleAssignments/{id}"
        id           = "65dc42b4-71be-4e0a-b1c2-11f961077e1d"
+       read_path    = "/connections/f29bed7c-a452-4329-b967-2c5a333a5bc9/roleAssignments/{id}"
+       update_path  = "/connections/f29bed7c-a452-4329-b967-2c5a333a5bc9/roleAssignments/{id}"
#        (3 unchanged attributes hidden)
    }

  # module.ws_conn_eventhub.restapi_object.connection_role_assignment["1"] will be updated in-place
!~  resource "restapi_object" "connection_role_assignment" {
!~      data         = jsonencode(
!~          {
-               id        = "5b2864ad-58d8-4442-a3e9-1c3d1a5cdca6"
+               principal = {
+                   id   = "5b2864ad-58d8-4442-a3e9-1c3d1a5cdca6"
+                   type = "User"
                }
+               role      = "User"
            }
        )
-       debug        = true -> null
+       destroy_path = "/connections/f29bed7c-a452-4329-b967-2c5a333a5bc9/roleAssignments/{id}"
        id           = "5b2864ad-58d8-4442-a3e9-1c3d1a5cdca6"
+       read_path    = "/connections/f29bed7c-a452-4329-b967-2c5a333a5bc9/roleAssignments/{id}"
+       update_path  = "/connections/f29bed7c-a452-4329-b967-2c5a333a5bc9/roleAssignments/{id}"
#        (3 unchanged attributes hidden)
    }

  # module.ws_conn_eventhub.restapi_object.connection_role_assignment["2"] will be updated in-place
!~  resource "restapi_object" "connection_role_assignment" {
!~      data         = jsonencode(
!~          {
-               id        = "aa5edc36-080b-4b9c-bcee-3b95cabd902d"
+               principal = {
+                   id   = "aa5edc36-080b-4b9c-bcee-3b95cabd902d"
+                   type = "User"
                }
+               role      = "Owner"
            }
        )
-       debug        = true -> null
+       destroy_path = "/connections/f29bed7c-a452-4329-b967-2c5a333a5bc9/roleAssignments/{id}"
        id           = "aa5edc36-080b-4b9c-bcee-3b95cabd902d"
+       read_path    = "/connections/f29bed7c-a452-4329-b967-2c5a333a5bc9/roleAssignments/{id}"
+       update_path  = "/connections/f29bed7c-a452-4329-b967-2c5a333a5bc9/roleAssignments/{id}"
#        (3 unchanged attributes hidden)
    }

  # module.ws_conn_eventhub.restapi_object.fabric_connection will be updated in-place
!~  resource "restapi_object" "fabric_connection" {
!~      data          = (sensitive value)
+       destroy_path  = "/connections/{id}"
        id            = "f29bed7c-a452-4329-b967-2c5a333a5bc9"
+       read_path     = "/connections/{id}"
+       update_method = "PATCH"
+       update_path   = "/connections/{id}"
#        (4 unchanged attributes hidden)
    }

Plan: 8 to add, 6 to change, 8 to destroy.

Warning: 'Eventstream' preview mode

  with fabric_eventstream.kql_demo_es,
  on kql-resources.tf line 48, in resource "fabric_eventstream" "kql_demo_es":
  48: resource "fabric_eventstream" "kql_demo_es" {

The behavior of 'Eventstream' may change in future releases without notice or
backward compatibility.

(and one more similar warning elsewhere)

Warning: Preview mode enabled

  with provider["registry.terraform.io/microsoft/fabric"],
  on provider.tf line 20, in provider "fabric":
  20: provider "fabric" {

Features available in preview mode are not yet generally available and may
change without notice include breaking changes. Production use is not
recommended. Use at your own risk!
```
</details>

:x: Error applying plan in [Terraform CD #2](https://github.com/RuneORakeie/sqlkonferenz2025/actions/runs/13589866164)